{
  "homepage": "https://www.northwesttreesgaming.com/mcmods/cctv-craft",
  "1.19.4": {
    "4.6.3": "Applied changes from 4.6.2\nPorted 4.6.2 to Forge 1.19.4",
    "4.6.1": "Ported 4.6.0 to 1.19.4",
    "4.5.1": "Ported the mod from 1.19.2 to 1.19.4"
  },
  "1.19.2": {
    "4.6.2": "Backported to 1.19.2\nFixed loot table for aluminum ore not working correctly.",
    "4.6.0": "Backported to 1.19.2\nAdded Aluminum Ore generation\nAdded A way to override sounds from Sound Blocks using the Alarm System.\nAdded Support for renaming Alarm Systems and Sound Blocks.\nAdded a new variable naming system to help manage NBT names in the future.\nAdded better Camera View icons when viewing cameras from monitors\nAdded blocks for Aluminum Ore, Sound Block, and Wall and Floor Alarm Systems.\nAdded items for Raw Aluminum, Copper Wire, Speaker, Aluminum Ingots and the Hand Saw\nAdded recipes for Alarm System, Raw Aluminum, Copper Wire, Sound Blocks, Speaker, and the Hand Saw\nAdded tags for Copper Wire, Aluminum Ore, Raw Aluminum, Aluminum Ingot, Speaker, Hand Saw, and Sound Blocks\nAdded Copper Wire resourced to replace Redstone Dust in recipes\nAdded block name to the message tag for Sound Blocks, Monitors, Cameras, and Jammers\nAdded on/off state to the Sound Block\nAdded on/off sound to both Jammer blocks\nAdded Permission Card support to the Sound Block\nAdded a Name USB support to the Sound Block\nAdded five Sound block alarm sounds\nAdded Sound Block and Alarm System GUIs\nAdded Out Of Rage text to monitor's connections page when a camera is out of range\nAdded remote support for cameras, monitors, and sound blocks\nAdded an easy way to update variables for Sound Blocks and Alarm Systems\nAdded distance, pitch and minimum volume control for Alarm System for even more customizability.\nAdded the drone name to 'Drone View' mode.\nUpdated Remote Floppy Disk Forge NBT tags\nUpdated the camera's Name variable to use a lowercase N instead.\nUpdated several recipes\nUpdated several recipe groups for items\nUpdated several textures for items and blocks\nUpdated the Permission Card and Remote Floppy Disk recipes\nUpdated some of the block and item textures\nRemoved old recipe unlocking system, this will be replaced using advancements\nRemoved fence gate and double fence gate AlternateRotation Forge NBT variable\nMonitors now read the new NBT variables from Remote Floppy Disks\nCapped camera view distance to fix a bug\nCamera view distance now is between 0 and 320 blocks between the monitor and camera\nMax camera distance no longer runs on world tick update, it now runs after the game rule command for it is executed\nJammers now have proper hitboxes\nMonitors now are toggled on/off without sneaking\nOpening the monitor GUI now requires you to sneak\nCameras, Monitors, Jammers, Drones, and Sound Blocks now use their localization for the default block name\nImproved the permission card script, not it uses just one tag\nPlayers using screwdrivers now require admin block permission to rotate the block.\nMade custom model and texture for the Sound Block\nSound Blocks have an on/off pixel to indicate the state\nBarbed Wire and Electric Fences no longer damage items.\nBarbed Wire is now seen as 'open' for pathfinding entities.\nFixed player in creative mode flying after exiting the camera view mode\nFixed monitor on/off display message\nFixed monitor GUI being able to be opened when the monitor was off\nFixed issue with the fence gates and double fence gates rotating when the block was clicked on the side.",
    "4.5.0": "Added custom buttons to the monitor screens\nThe monitor connection tab now shows camera tags eg. Jammed, On, or Off\nMonitor lights now indicate if the camera is on or off\nMonitor switches now indicate if the floppy slot is full or not\nCamera names can now be updated via the monitor\nJammers now show an on/off light depending on their state\nCompacted models for monitors, cameras, jammers, and chain fence types\nFixed the monitor screen name text\nFixed the monitor screen connection text\nFixed camera zoom for North, East, South-East and North-East directions\nFixed zoom-in issue with Noth-East for the ceiling camera\nFixed monitor GUI lights not unblinking when the camera is missing\nFixed camera view overlay camera name text\nFixed overlay for drone inventory slot item and slot number text\nFixed Name USB text field adding to the last input.",
    "4.4.1": "Fixed a crash that happened only on the server side when mining blocks with the drone.",
    "4.4.0": "Ported CCTV Craft to Minecraft 1.19.2"
  },
  "1.18.2": {
    "4.2.0": "Ported modification to Minecraft 1.18.2",
    "4.2.1": "Fixed some message issues with some items and blocks\nFixed issues with blocks and right-click events when holding items such as blocks",
    "4.3.0": "Added blocks of Drone Charging Station, Solar Panel, 16 Drones\nAdded creative tabs\nAdded drone blocks\nAdded drone actions\nAdded drone bomb projectiles and entities\nAdded drone controller\nAdded drone gun projectiles\nAdded drone inventory screen\nAdded drone key binds\nAdded drone key binds for movement\nAdded drone key binds for movement speed\nAdded drone key binds for slot selection\nAdded drone key binds to rotate drones left or right\nAdded drone modes for Night Vision, Flashlight\nAdded drone overlay\nAdded drone overlay icons for drone mode\nAdded many new recipes\nAdded more resource items\nAdded recipe for Barbed Wire\nAdded support to use the Name USB to name drones\nAdded support for permission cards for drones\nAdded tags for new recipes\nCleaned up overlays for the original camera view mode to add support for drones\nDrone blades will stop moving when the block is off\nDrones use existing key binds for Modes M and exiting camera view X\nDrones have a total of 18 storage slots and 6 ammo slots\nDrones will shut off when energy points reach 0\nDrones can't fly anywhere other than air blocks\nDrones docked on top of charging stations will convert FE into energy points for the drone\nMoved items and blocks from the old creative tab to the new ones\nPermission Cards now use a block tag for allowed blocks\nRemoved original creative tab\nSolar Panel Blocks will charge better in clear weather while thundering will lower the charge\nThe drone flashlight mode can reach a total of 24 blocks away\nThe drone action Move Block will grab blocks in front of the drone and move them\nUpdated and added some confirmation messages for blocks and items\nUpdated some recipe group names\nUpdated some recipe tags\nFixed an issue where zooming was possible behind the camera in some cases\nFixed an issue with the flashlight crashing the game due to a sync mismatch\nFixed issue where inventories were cleared\nFixed issue with the previous camera button when six cameras were stored\nFixed jammer recipe not working"
  },
  "1.17.1": {
    "4.1.0": "Added cctvcraft:recipe/dye/cyan item tag.\nAdded cctvcraft:recipe/gold_nugget item tag.\nAdded Barbed Wire blocks.\nAdded Barbed Wire crafting recipe.\nAdded blood overlay.\nAdded Camera Name to the camera view overlay.\nAdded Chain Fence blocks.\nAdded Chain Fence crafting recipe.\nAdded crafting resource for cameras called Lense.\nAdded crafting resource for floppy disks called Magnetic Coated Disk.\nAdded crafting resource for monitors called Display.\nAdded Electric Chain Fence blocks.\nAdded Electric Chain Fence crafting recipe.\nAdded new camera name to the camera view overlay.\nAdded new camera numbers to the camera view overlay.\nAdded new range bars to the camera view overlay.\nAdded Permission Card for editing camera members and admins.\nAdded Permission Card crafting recipe.\nAdded Screwdriver crafting recipe.\nAdded Screwdriver tool for rotating some blocks.\nAdmin permissions are a list of people that can set permissions.\nCamera Names now auto fill to the monitor when adding a remote floppy disk to the monitor.\nFences, Electric Fences, and Barbed Wire now have a chain placed sound when they are rotated.\nIf the block has no members anyone can use the block.\nIf the block has no admins anyone can set permissions for both admin and members.\nIt is now possible to rotate monitors and cameras with the screwdriver.\nIt is now possible to set admin and member permissions to cameras and monitors.\nMaximum Camera distance can now be changed using Game Rules.\nMember permissions are a list of people that can use the block.\nMonitors and cameras now have a button sound when turning on/off the blocks.\nMonitors and cameras now have a metal place sound when they are rotated.\nName USB menu text fields now get and fill the text field with the display name of the Name USB.\nOn/Off states for monitors and blocks now use strings.\nScrewdrivers now have a sound when the tool breaks.\nFixed being able to view a camera that is outside of the view distance.\nFixed major issue with flickering overlays when camera was outside of rendering distance.\nFixed Name USB menu not closing when a name has been set.\nFixed Name USB menu opening when right-clicking on a camera\nFixed range icons from not displaying.\nFixed zoom when switching between cameras.\nRemote Floppy Disks may need to be relinked to cameras if you have downloaded 4.0.0.\nChanges have been made to the linking system to make the system more stable.\nMembers support has been added and is early stages of development for a permission based system there may be some bugs still with it."
  },
  "1.16.5": {
    "4.0.0": "4.0.0 is a remake of CCTV Craft and no longer requires Pixelvar or MMP UUID mods to work properly.\nThe mod has been tested and seems to work fine without any issues, if you find a bug please report it on our GitHub repository under issues so we can patch it.\n\nAdded Camera Block blocks.\nAdded Ceiling Camera blocks.\nAdded Small Camera blocks.\nAdded Monitor blocks.\nAdded both item and block tags for all blocks.\nAdded on/off states for all blocks, they can be toggled by Sneaking + Right-clicking the block.\nCameras do not work if they are in the off state.\n\nAdded Remote Floppy Disk item.\nAdded Name USB item.\nName USB can set names to camera that will mask the Remote Floppy Disk display name for the camera when linked.\nRemote Floppy Disks can be right-clicked on cameras to store the cameras data and position so that it can be linked to the monitor.\nRemote Floppy Disks can be added to monitors by right-clicking with the item in the main hand on the monitor.\n\nAdded a creative tab for CCTV Craft.\nAdded all cameras, monitor, floppy disks, and usbs to the creative tab.\n\nAdded crafting recipes for Naming USB, Remote Floppy Disk, All Cameras, and the Monitor.\nAdded a recipe unlocking system so players can unlock recipes once they have a item in their inventories.\nRecipe crafting items now use tags.\n\nAdded key binds for zooming in and out when viewing cameras. Default is W for zooming in and S for zooming out.\nAdded key binds for cycling between cameras when viewing cameras. Default is A for pervious and D for next.\nAdded key binds for changing mods when viewing cameras. Default is M.\nAdded key binds for exiting camera view mode. Default mode is X.\n\nAdded based overlay for the camera view mode.\nAdded vignette overlay based on the distance of the connected camera.\nAdded night vision overlay for when night-vision mode is active.\nThe base overlay is now animated.\n\nAdded Monitor GUI screens Main Menu, Connections, Naming.\nAdded Name USB GUI screen.\n\nAdded support for viewing cameras.\nAdded support for keeping track of who places blocks using the NBT variable Owner and the players display name.\nCameras now have view positions.\nCameras and monitors can now be toggled on/off.\nCamera slots can be named but do not hold any particular use at this point in time.\nFixed a crash when a monitor was exploded when the player was viewing the camera causing the player to not be able to rejoin the world.\nFixed night vision mode flickering due to a potion duration issue.",
    "4.1.0": "Added cctvcraft:recipe/dye/cyan item tag.\nAdded cctvcraft:recipe/gold_nugget item tag.\nAdded Barbed Wire blocks.\nAdded Barbed Wire crafting recipe.\nAdded blood overlay.\nAdded Camera Name to the camera view overlay.\nAdded Chain Fence blocks.\nAdded Chain Fence crafting recipe.\nAdded crafting resource for cameras called Lense.\nAdded crafting resource for floppy disks called Magnetic Coated Disk.\nAdded crafting resource for monitors called Display.\nAdded Electric Chain Fence blocks.\nAdded Electric Chain Fence crafting recipe.\nAdded new camera name to the camera view overlay.\nAdded new camera numbers to the camera view overlay.\nAdded new range bars to the camera view overlay.\nAdded Permission Card for editing camera members and admins.\nAdded Permission Card crafting recipe.\nAdded Screwdriver crafting recipe.\nAdded Screwdriver tool for rotating some blocks.\nAdmin permissions are a list of people that can set permissions.\nCamera Names now auto fill to the monitor when adding a remote floppy disk to the monitor.\nFences, Electric Fences, and Barbed Wire now have a chain placed sound when they are rotated.\nIf the block has no members anyone can use the block.\nIf the block has no admins anyone can set permissions for both admin and members.\nIt is now possible to rotate monitors and cameras with the screwdriver.\nIt is now possible to set admin and member permissions to cameras and monitors.\nMaximum Camera distance can now be changed using Game Rules.\nMember permissions are a list of people that can use the block.\nMonitors and cameras now have a button sound when turning on/off the blocks.\nMonitors and cameras now have a metal place sound when they are rotated.\nName USB menu text fields now get and fill the text field with the display name of the Name USB.\nOn/Off states for monitors and blocks now use strings.\nScrewdrivers now have a sound when the tool breaks.\nFixed being able to view a camera that is outside of the view distance.\nFixed major issue with flickering overlays when camera was outside of rendering distance.\nFixed Name USB menu not closing when a name has been set.\nFixed Name USB menu opening when right-clicking on a camera\nFixed range icons from not displaying.\nFixed zoom when switching between cameras.\nRemote Floppy Disks may need to be relinked to cameras if you have downloaded 4.0.0.\nChanges have been made to the linking system to make the system more stable.\nMembers support has been added and is early stages of development for a permission based system there may be some bugs still with it."
  },
  "1.15.2": {
    "3.0.0": "Added three types of cameras and one type of monitor.\nCameras can be linked to monitors.\nMonitors allow for the viewing of cameras.\nAdded Remote Floppy used for an easy way to link cameras to monitors\nAdded Security Floppy used to manage permissions for the device\nAdded Action Floppy used to do tasks such as remove the block.\nAdded recipes and advancements"
  },
  "1.14.4": {
    "1.0.0": "Added Silico Wireless Receiver Crafting Item\nAdded Silico Cobalt Chip Lowest Tier Crafting Item\nAdded Centro Monitor 2000 Lowest Tier Monitor\nAdded Vyper Camera 1900 Lowest Tier Camera\nAdded Viewing Mechanics to the camera and support for future cameras and monitors\nAdded Key binds to move the camera and point the direction to view the camera",
    "1.1.0": "Added Vyper Camera 1900 Camera View Overlay\nTexture Silico Cobalt Chip has been re-textured\nBug Fix F5 Bug due to using the wrong NBT element. The same issue as the Camera Pitch Bug\nBug Fix Potential exploit from Spectator Now uses adventure with potion effects of invisibility\nBug Fix Variable Names all variables now use cctvcraft before their tag or name so it's more compatible with mods",
    "3.0.0": "Added three types of cameras and one type of monitor\nCameras can be linked to monitors.\nMonitors allow for the viewing of cameras\nAdded Remote Floppy used for an easy way to link cameras to monitors\nAdded Security Floppy used to manage permissions for the device\nAdded Action Floppy used to do tasks such as remove the block.\nAdded recipes and advancements" 
  },
  "promos": {
    "1.19.4-latest": "4.6.3",
    "1.19.4-recommended": "4.6.3",
    "1.19.2-latest": "4.6.2",
    "1.19.2-recommended": "4.6.2",
    "1.18.2-latest": "4.3.0",
    "1.18.2-recommended": "4.3.0",
    "1.17.1-latest": "4.1.0",
    "1.17.1-recommended": "4.1.0",
    "1.16.5-latest": "4.1.0",
    "1.16.5-recommended": "4.1.0",
    "1.15.2-latest": "3.0.0",
    "1.15.2-recommended": "3.0.0",
    "1.14.4-latest": "3.0.0",
    "1.14.4-recommended": "3.0.0"
  }
}
